tap "dart-lang/dart"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "wez/wezterm"
brew "aichat"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "arduino-cli"
brew "coreutils"
brew "openssl@3"
brew "asdf"
brew "boost"
brew "glib"
brew "cairo"
brew "cmake"
brew "deno"
brew "dfu-programmer"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gawk"
brew "ghq"
brew "git"
brew "git-flow"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "gotop"
brew "hub"
brew "mecab"
brew "mecab-ipadic"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "peco"
brew "pfetch"
brew "tcl-tk"
brew "pillow"
brew "python@3.9"
brew "python-tk@3.9"
brew "python@3.10"
brew "python@3.11"
brew "ripgrep"
brew "rustup-init"
brew "silicon"
brew "spotify-tui"
brew "starship"
brew "stylua"
brew "tmux"
brew "tree"
brew "wget"
brew "z"
brew "zellij"
brew "dart-lang/dart/dart"
brew "felixkratz/formulae/sketchybar"
brew "hudochenkov/sshpass/sshpass"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "qmk/qmk/qmk"
cask "alacritty"
cask "amethyst"
cask "font-jetbrains-mono-nerd-font"
cask "kitty"
cask "raycast"
cask "warp"
cask "wezterm"
