tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "wez/wezterm"
brew "anyenv"
brew "glib"
brew "python@3.9"
brew "deno"
brew "dfu-programmer"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "ghq"
brew "git"
brew "go"
brew "gobject-introspection"
brew "hub"
brew "mecab"
brew "mecab-ipadic"
brew "neovim"
brew "nghttp2"
brew "peco"
brew "python-tk@3.9"
brew "ripgrep"
brew "rustup-init"
brew "spotify-tui"
brew "starship"
brew "tmux"
brew "wget"
brew "z"
brew "zellij"
brew "dart-lang/dart/dart"
brew "hudochenkov/sshpass/sshpass"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "qmk/qmk/qmk"
cask "wezterm"
