tap "dart-lang/dart"
tap "felixkratz/formulae"
tap "hudochenkov/sshpass"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "olets/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "wez/wezterm"
# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Arduino command-line interface
brew "arduino-cli"
# Collection of portable C++ source libraries
brew "boost"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Device firmware update based USB programmer for Atmel chips
brew "dfu-programmer"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Yet another part-of-speech and morphological analyzer
brew "mecab"
# IPA dictionary compiled for MeCab
brew "mecab-ipadic"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Simplistic interactive filtering tool
brew "peco"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Python interface to Tcl/Tk
brew "python-tk@3.9"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Smart session manager for the terminal
brew "sesh"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Create beautiful image of your source code
brew "silicon"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Tool Command Language
brew "tcl-tk"
# Terminal multiplexer
brew "tmux"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Tracks most-used directories to make cd smarter
brew "z"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# SDK
brew "dart-lang/dart/dart"
brew "hudochenkov/sshpass/sshpass"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono"
cask "font-monaspace"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# GPU-based terminal emulator
cask "kitty"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Multiplayer code editor
cask "zed"
