tap "hudochenkov/sshpass"
tap "nikitabobko/tap"
tap "osx-cross/arm"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Arduino command-line interface
brew "arduino-cli"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@78"
# Collection of portable C++ source libraries
brew "boost"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Device firmware update based USB programmer for Atmel chips
brew "dfu-programmer"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# OpenType text shaping engine
brew "harfbuzz"
# Add GitHub support to git on the command-line
brew "hub"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# New file format for still image compression
brew "jpeg-xl"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Yet another part-of-speech and morphological analyzer
brew "mecab"
# IPA dictionary compiled for MeCab
brew "mecab-ipadic"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Framework for layout and rendering of i18n text
brew "pango"
# Simplistic interactive filtering tool
brew "peco"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Smart session manager for the terminal
brew "sesh"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Create beautiful image of your source code
brew "silicon"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Tool Command Language
brew "tcl-tk"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Terminal multiplexer
brew "tmux"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
brew "hudochenkov/sshpass/sshpass"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# GPU-based terminal emulator
cask "kitty"
# SKK Input Method
cask "macskk"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Multiplayer code editor
cask "zed"
